Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp

#include "CANIface.h"

#if HAL_NUM_CAN_IFACES > 0

#include <AP_HAL/AP_HAL.h>
#include "Scheduler.h"           // For register_task_with_watchdog()
#include "driver/gpio.h"
#include "driver/twai.h"
#include "esp_debug_helpers.h"  // For esp_backtrace_print()
#include "esp_task_wdt.h"       // For esp_task_wdt_add()

extern const AP_HAL::HAL& hal;

using namespace ESP32;

// Use consistent ESP32 debug system controlled by ESP32_DEBUG_LVL parameter
#include "ESP32_Debug.h"

// CAN logging macros using ESP32 debug system
#define CAN_DEBUG_ERROR(fmt, ...)   ESP_LOGE("CAN", fmt, ##__VA_ARGS__)
#define CAN_DEBUG_WARN(fmt, ...)    ESP_LOGW("CAN", fmt, ##__VA_ARGS__)  
#define CAN_DEBUG_INFO(fmt, ...)    ESP_LOGI("CAN", fmt, ##__VA_ARGS__)
#define CAN_DEBUG_VERBOSE(fmt, ...) ESP_LOGD("CAN", fmt, ##__VA_ARGS__)
#define CAN_DEBUG_DEBUG(fmt, ...)   ESP_LOGV("CAN", fmt, ##__VA_ARGS__)

// Legacy compatibility
#define CAN_DEBUG_PRINTF(fmt, ...) CAN_DEBUG_INFO(fmt, ##__VA_ARGS__)

CANIface::CANIface(uint8_t instance) :
    ESP32_CANBase(instance),
    initialized(false),
    current_bitrate(500000),
    tx_tracker_index(0)
{
    // Initialize tx_tracker array
    memset(tx_tracker, 0, sizeof(tx_tracker));
}

bool CANIface::init(const uint32_t bitrate, const OperatingMode mode)
{
    // Log level is now controlled by ESP32_Params.cpp for consistency
    // Removed local override to avoid conflicts
    
    CAN_DEBUG_INFO("CAN interface %d initialized - bitrate=%u", instance, (unsigned)bitrate);
    CAN_DEBUG_INFO("CAN debug test - you should see this message!");
    CAN_DEBUG_VERBOSE("CAN_LOGLEVEL=%d, ESP-IDF log level set appropriately", CAN_LOGLEVEL);
    
    if (initialized) {
        CAN_DEBUG_INFO("CAN interface %d already initialized", instance);
        return true;
    }
    
    current_bitrate = bitrate;

    gpio_num_t tx_pin, rx_pin;

    if (instance == 0) {
#if HAL_NUM_CAN_IFACES > 0
        tx_pin = (gpio_num_t)HAL_CAN1_TX_PIN;
        rx_pin = (gpio_num_t)HAL_CAN1_RX_PIN;
        CAN_DEBUG_INFO("Initializing CAN interface %d with TX pin %d, RX pin %d, bitrate %u", 
               instance, (int)tx_pin, (int)rx_pin, (unsigned)bitrate);
#else
        CAN_DEBUG_ERROR("HAL_NUM_CAN_IFACES is 0, CAN disabled");
        return false;
#endif
    } else {
        // Only support CAN interface 0 with native TWAI
        // CAN interface 1+ should use MCP2515 or other external controllers
        CAN_DEBUG_ERROR("Instance %d not supported (only instance 0 supported)", instance);
        return false;
    }

    twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(tx_pin, rx_pin, TWAI_MODE_NORMAL);
    twai_timing_config_t t_config;
    switch (bitrate) {
    case 1000000:
        t_config = TWAI_TIMING_CONFIG_1MBITS();
        break;
    case 500000:
        t_config = TWAI_TIMING_CONFIG_500KBITS();
        break;
    case 250000:
        t_config = TWAI_TIMING_CONFIG_250KBITS();
        break;
    case 125000:
        t_config = TWAI_TIMING_CONFIG_125KBITS();
        break;
    default:
        return false;
    }

    twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

    CAN_DEBUG_INFO("Installing TWAI driver...");
    esp_err_t install_result = twai_driver_install(&g_config, &t_config, &f_config);
    if (install_result != ESP_OK) {
        CAN_DEBUG_ERROR("TWAI driver install failed with error %d", install_result);
        return false;
    }
    CAN_DEBUG_INFO("TWAI driver installed successfully");

    CAN_DEBUG_INFO("Starting TWAI...");
    esp_err_t start_result = twai_start();
    if (start_result != ESP_OK) {
        CAN_DEBUG_ERROR("TWAI start failed with error %d", start_result);
        return false;
    }
    CAN_DEBUG_INFO("TWAI started successfully");

    // Wait for bus to become ready (needs to see 11 recessive bits)
    // The TWAI controller may stay in STOPPED state until it detects bus activity
    twai_status_info_t init_status;
    uint32_t wait_start_ms = AP_HAL::millis();
    bool bus_ready = false;

    while ((AP_HAL::millis() - wait_start_ms) < 2000) {  // Wait up to 2 seconds
        if (twai_get_status_info(&init_status) == ESP_OK) {
            if (init_status.state == TWAI_STATE_RUNNING) {
                CAN_DEBUG_INFO("TWAI transitioned to RUNNING state after %lums",
                              (unsigned long)(AP_HAL::millis() - wait_start_ms));
                bus_ready = true;
                break;
            }
        }
        hal.scheduler->delay_microseconds(1000);  // 1ms delay with watchdog feeding
    }

    if (!bus_ready) {
        // Log warning but don't fail - the bus might become ready later when other nodes appear
        if (twai_get_status_info(&init_status) == ESP_OK) {
            CAN_DEBUG_WARN("TWAI did not reach RUNNING state after 2s (state=%d). Bus may need other nodes.",
                          init_status.state);
        } else {
            CAN_DEBUG_WARN("TWAI did not reach RUNNING state after 2s. Bus may need other nodes.");
        }
        // Continue anyway - TX will handle invalid state errors gracefully
    }

    // Only create queues and tasks if this is the first initialization
    // For recovery, the tasks keep running and will handle the new TWAI state
    if (rx_queue == NULL) {
        CAN_DEBUG_INFO("Creating RX queue...");
        rx_queue = xQueueCreate(512, sizeof(CanRxItem));  // Increased from 128 to prevent drops
        if (rx_queue == NULL) {
            CAN_DEBUG_ERROR("Failed to create RX queue");
            return false;
        }
    } else {
        // Clear existing queue for fresh start
        xQueueReset(rx_queue);
    }

    if (tx_queue == NULL) {
        CAN_DEBUG_INFO("Creating TX queue...");
        tx_queue = xQueueCreate(256, sizeof(CanTxItem));  // Also increased TX queue
        if (tx_queue == NULL) {
            CAN_DEBUG_ERROR("Failed to create TX queue");
            vQueueDelete(rx_queue);  // Clean up RX queue on failure
            rx_queue = NULL;
            return false;
        }
    } else {
        // Clear existing queue for fresh start
        xQueueReset(tx_queue);
    }

    // Only create tasks on first init, not during recovery
    if (rx_task_handle == NULL) {
        CAN_DEBUG_INFO("Creating RX and TX tasks...");
        xTaskCreate(rx_task, "can_rx", 4096, this, 5, &rx_task_handle);
        // Higher priority for TX task to reduce latency in DNA responses
        xTaskCreate(tx_task, "can_tx", 4096, this, 6, &tx_task_handle);
    } else {
        CAN_DEBUG_INFO("Tasks already running, continuing with recovery");
    }

    initialized = true;
    CAN_DEBUG_INFO("Interface %d initialization complete!", instance);

