Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
    return true;
}

int16_t CANIface::send(const AP_HAL::CANFrame &frame, uint64_t tx_deadline, AP_HAL::CANIface::CanIOFlags flags)
{
    if (!initialized) {
        return -1;
    }


    CanTxItem tx_item;
    tx_item.frame = frame;
    tx_item.deadline_us = tx_deadline;
    tx_item.flags = flags;

    if (xQueueSendToBack(tx_queue, &tx_item, 0) != pdPASS) {
        return 0;
    }

    return 1;
}

int16_t CANIface::receive(AP_HAL::CANFrame &frame, uint64_t &timestamp_us, AP_HAL::CANIface::CanIOFlags &flags)
{
    if (!initialized) {
        return -1;
    }

    CanRxItem rx_item;
    if (xQueueReceive(rx_queue, &rx_item, 0) != pdPASS) {
        return 0;
    }

    frame = rx_item.frame;
    timestamp_us = rx_item.timestamp_us;
    flags = rx_item.flags;

    return 1;
}

bool CANIface::add_to_rx_queue(const CanRxItem &rx_item)
{
    return xQueueSendToBack(rx_queue, &rx_item, 0) == pdPASS;
}

void CANIface::rx_task(void *arg)
{
    CANIface *iface = (CANIface *)arg;

    // Register this task with watchdog
    ESP32::Scheduler::register_task_with_watchdog("can_rx");

    CAN_DEBUG_INFO("CAN RX task started for interface %d", iface->instance);

    while (true) {
        // Check if restart is in progress
        if (iface->restart_in_progress) {
            // During restart, just wait without trying to receive
            // Reset watchdog during the wait to prevent timeout
            esp_task_wdt_reset();
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        twai_message_t message;
        // Use timeout instead of portMAX_DELAY to allow recovery after TWAI restart
        esp_err_t rx_result = twai_receive(&message, pdMS_TO_TICKS(100));

        // Always reset watchdog after receive attempt (success or timeout)
        esp_task_wdt_reset();

        if (rx_result != ESP_OK) {
            // Handle RX errors with enhanced detection
            if (rx_result == ESP_ERR_TIMEOUT) {
                // Normal timeout - no action needed
                continue;
            } else if (rx_result == ESP_FAIL) {
                // RX failure - check bus state
                twai_status_info_t twai_status;
                if (twai_get_status_info(&twai_status) == ESP_OK) {
                    if (twai_status.state == TWAI_STATE_BUS_OFF) {
                        CAN_DEBUG_ERROR("Bus-off detected during receive");
                        iface->update_error_stats(0x01); // Bus-off error
                    } else if (twai_status.state == TWAI_STATE_STOPPED) {
                        CAN_DEBUG_ERROR("TWAI stopped unexpectedly");
                        iface->update_error_stats(0x02); // Stopped error
                    }
                }
            } else {
                // Other RX errors
                iface->update_error_stats(rx_result);
            }
            continue;
        }

#if CAN_LOGLEVEL >= 4
        // Verbose frame-by-frame logging - use ESP-IDF VERBOSE level
        static uint32_t rx_count = 0;
        rx_count++;
        
        char data_str[32] = {0};
        for (int i = 0; i < message.data_length_code && i < 8; i++) {
            snprintf(data_str + (i * 3), sizeof(data_str) - (i * 3), "%02X ", message.data[i]);
        }
        
        CAN_DEBUG_VERBOSE("RX #%lu: ID=0x%08X DLC=%d DATA=[%s]", 
                         (unsigned long)rx_count, (unsigned)message.identifier, 
                         message.data_length_code, data_str);
#elif CAN_LOGLEVEL >= 3
        // INFO level - summary every 100 frames
        static uint32_t rx_count_summary = 0;
        rx_count_summary++;
        if ((rx_count_summary % 100) == 0) {
            CAN_DEBUG_INFO("Received %lu frames, latest ID=0x%08X", 
                           (unsigned long)rx_count_summary, (unsigned)message.identifier);
        }
#elif CAN_LOGLEVEL >= 2
        // WARN level - summary every 1000 frames (less verbose)
        static uint32_t rx_count_warn = 0;
        rx_count_warn++;
        if ((rx_count_warn % 1000) == 0) {
            CAN_DEBUG_WARN("CAN traffic detected: %lu frames received", (unsigned long)rx_count_warn);
        }
#endif

        CanRxItem rx_item;
        rx_item.timestamp_us = AP_HAL::micros64();
        rx_item.frame.id = message.identifier;
        if (message.extd) {
            rx_item.frame.id |= AP_HAL::CANFrame::FlagEFF;  // Set extended frame flag
        }
        rx_item.frame.dlc = message.data_length_code;
        memcpy(rx_item.frame.data, message.data, message.data_length_code);
        rx_item.flags = 0;
        
        // Check if this is a self-transmitted frame
        bool is_self_tx = false;
        bool loopback_requested = false;
        for (uint8_t i = 0; i < TX_TRACKER_SIZE; i++) {
            if (iface->tx_tracker[i].can_id == message.identifier &&
                iface->tx_tracker[i].timestamp_us != 0) {
                is_self_tx = true;
                loopback_requested = iface->tx_tracker[i].loopback_requested;
                iface->tx_tracker[i].timestamp_us = 0; // Clear entry
                break;
            }
        }

        if (is_self_tx && !loopback_requested) {
            // Self-transmitted frame without loopback - drop it
            ESP_LOGW("CAN_RX", "SELF-TX detected! Dropping frame ID=0x%08X",
                     (unsigned)message.identifier);
            continue;
        }
        
        if (is_self_tx && loopback_requested) {
            rx_item.flags = AP_HAL::CANIface::Loopback;
        }

        // Update statistics
        iface->update_rx_stats();

        if (!iface->add_to_rx_queue(rx_item)) {
            // Queue full - frame dropped
            static uint32_t drop_count = 0;
            drop_count++;
            if ((drop_count % 100) == 1) {  // Log every 100 drops to avoid spam
                ESP_LOGW("CAN_RX", "RX queue full! Dropped %lu frames", (unsigned long)drop_count);
            }
        }
    }
}

void CANIface::tx_task(void *arg)
{
    CANIface *iface = (CANIface *)arg;

    // Register this task with watchdog
    ESP32::Scheduler::register_task_with_watchdog("can_tx");

    CanTxItem tx_item;

    while (true) {
        // Check if restart is in progress
        if (iface->restart_in_progress) {
            // During restart, just wait without trying to transmit
            // Reset watchdog during the wait to prevent timeout
            esp_task_wdt_reset();
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        // Wait for a frame from the queue
        if (xQueueReceive(iface->tx_queue, &tx_item, pdMS_TO_TICKS(100)) != pdPASS) {
            // Reset watchdog after queue wait timeout
            esp_task_wdt_reset();
            continue; // No message available, go back to outer loop
        }

        // Reset watchdog after successful queue receive
        esp_task_wdt_reset();

        // Check if this frame has expired
        uint64_t now_us = AP_HAL::micros64();
        if (tx_item.deadline_us != 0 && now_us > tx_item.deadline_us) {
            static uint32_t expired_count = 0;
            expired_count++;
            // Only log first few expired frames to avoid spam
            if (expired_count <= 5 || expired_count % 10 == 0) {
                CAN_DEBUG_VERBOSE("Dropped expired frame ID=0x%08X (deadline=%llu, now=%llu) [count=%lu]",
                       (unsigned)tx_item.frame.id, tx_item.deadline_us, now_us, (unsigned long)expired_count);
            }
            continue; // Skip expired frame
        }

        // Verbose frame-by-frame TX logging
        char data_str[32] = {0};
        for (int i = 0; i < tx_item.frame.dlc && i < 8; i++) {
            snprintf(data_str + (i * 3), sizeof(data_str) - (i * 3), "%02X ", tx_item.frame.data[i]);
        }
        CAN_DEBUG_VERBOSE("TX: ID=0x%08X DLC=%d DATA=[%s]", (unsigned)tx_item.frame.id, tx_item.frame.dlc, data_str);

