Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
        twai_message_t message;
        memset(&message, 0, sizeof(message));
        
        // Check if this is an extended frame (bit 31 set means extended)
        if (tx_item.frame.isExtended()) {
            // Extended frame: strip the FlagEFF bit and use only the 29-bit ID
            message.identifier = tx_item.frame.id & AP_HAL::CANFrame::MaskExtID;
            message.extd = 1;
            
            // Validate that the ID is within 29-bit range
            if (message.identifier > 0x1FFFFFFF) {
                CAN_DEBUG_ERROR("Invalid extended CAN ID 0x%08X (exceeds 29-bit max), masking to 29 bits", 
                               (unsigned)tx_item.frame.id);
                message.identifier &= 0x1FFFFFFF;
            }
        } else {
            // Standard frame: use only the 11-bit ID
            message.identifier = tx_item.frame.id & AP_HAL::CANFrame::MaskStdID;
            message.extd = 0;
            
            // Validate that the ID is within 11-bit range
            if (message.identifier > 0x7FF) {
                CAN_DEBUG_ERROR("Invalid standard CAN ID 0x%08X (exceeds 11-bit max), masking to 11 bits", 
                               (unsigned)tx_item.frame.id);
                message.identifier &= 0x7FF;
            }
        }
        
        // Validate and clamp DLC to valid range
        if (tx_item.frame.dlc > 8) {
            CAN_DEBUG_ERROR("Invalid DLC %d for message ID=0x%08X, clamping to 8", 
                           tx_item.frame.dlc, (unsigned)tx_item.frame.id);
            message.data_length_code = 8;
        } else {
            message.data_length_code = tx_item.frame.dlc;
        }
        
        message.rtr = tx_item.frame.isRemoteTransmissionRequest() ? 1 : 0;
        message.ss = 0;    // Allow retransmission
        message.self = 0;  // Not self-reception
        memcpy(message.data, tx_item.frame.data, message.data_length_code);
        
        // Debug CAN ID issues
        // DroneCAN extended frame format: 
        // Bits 28-24: Priority (5 bits)
        // Bits 23-8: Message type (16 bits) 
        // Bit 7: Service not message
        // Bits 6-0: Source node ID (7 bits)
        //uint8_t priority = (message.identifier >> 24) & 0x1F;  // Unused for now
        //uint16_t msg_type = (message.identifier >> 8) & 0xFFFF;  // Unused after removing type 342 debug
        //bool is_service = (message.identifier >> 7) & 0x01;  // Unused for now
        //uint8_t source_node = message.identifier & 0x7F;  // Unused after removing type 342 debug
        
        // FlagEFF (bit 31) is normal for extended frame format - no need to log
        
        // CAN message counting disabled - not needed in production
        
        
        // Commented out verbose logging

        // Single transmission attempt for DroneCAN compliance
        // DroneCAN handles reliability at protocol layer, HAL retries violate timing assumptions
        const TickType_t timeout_ms = 10; // Allow sufficient time for transmission
        
        esp_err_t result = twai_transmit(&message, pdMS_TO_TICKS(timeout_ms));
        
        if (result == ESP_OK) {
            // Track for self-reception filtering
            iface->tx_tracker[iface->tx_tracker_index].can_id = message.identifier;
            iface->tx_tracker[iface->tx_tracker_index].timestamp_us = AP_HAL::micros64();
            iface->tx_tracker[iface->tx_tracker_index].loopback_requested = (tx_item.flags & AP_HAL::CANIface::Loopback) != 0;
            iface->tx_tracker_index = (iface->tx_tracker_index + 1) % TX_TRACKER_SIZE;
        }
        
        // Update statistics and handle errors
        iface->update_tx_stats(result == ESP_OK);
        
        if (result != ESP_OK) {
            // Handle specific TWAI error conditions
            if (result == ESP_ERR_TIMEOUT) {
                // TX timeout - bus may be congested or disconnected
                // Count timeouts but don't log them - stats are tracked elsewhere
                static uint32_t timeout_count = 0;
                timeout_count++;
                // Disabled - CAN stats are available via MAVLink
                // Only enable for debugging CAN issues
#if 0
                if (timeout_count <= 5 || (timeout_count % 1000) == 0) {
                    CAN_DEBUG_WARN("TX timeout on message ID=0x%08X (total timeouts=%lu)",
                                   (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID),
                                   (unsigned long)timeout_count);
                }
#endif
            } else if (result == ESP_FAIL) {
                // TX failed - check bus state
                twai_status_info_t twai_status;
                if (twai_get_status_info(&twai_status) == ESP_OK) {
                    if (twai_status.state == TWAI_STATE_BUS_OFF) {
                        // Bus-off condition detected - attempt recovery
                        CAN_DEBUG_ERROR("Bus-off detected, attempting recovery");
                        iface->update_error_stats(0x01); // Bus-off error code
                        
                        // Attempt bus recovery
                        twai_initiate_recovery();
                        // Note: Recovery is automatic in TWAI driver
                    }
                }
                // Reduce log spam - only log occasionally
                static uint32_t fail_count = 0;
                fail_count++;
                if (fail_count <= 5 || (fail_count % 100) == 0) {
                    CAN_DEBUG_ERROR("Failed to transmit message ID=0x%08X, error=%d (count=%lu)", 
                                    (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID), 
                                    result, (unsigned long)fail_count);
                }
            } else if (result == ESP_ERR_INVALID_STATE) {
                // TWAI driver in invalid state - likely no other nodes on bus or disconnection
                // Continue processing queue to prevent buildup, just can't transmit yet
                static uint32_t last_invalid_state_log_ms = 0;
                static uint32_t invalid_state_count = 0;
                static uint32_t messages_dropped = 0;
                static uint32_t last_recovery_attempt_ms = 0;
                static uint32_t recovery_backoff_ms = 100;  // Start with 100ms backoff
                uint32_t now_ms = AP_HAL::millis();
                invalid_state_count++;
                messages_dropped++;  // Count this as a dropped message

