Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
                // Diagnostic: Check actual TWAI state when we get invalid state error
                twai_status_info_t diagnostic_status;
                bool got_status = (twai_get_status_info(&diagnostic_status) == ESP_OK);

                if (got_status) {
                    // Log the actual state to verify TX invalid state (0=STOPPED, 1=RUNNING, 2=BUS_OFF, 3=RECOVERING)
                    if (invalid_state_count == 1 || (invalid_state_count % 100) == 0) {
                        const char* state_str = "UNKNOWN";
                        switch (diagnostic_status.state) {
                            case TWAI_STATE_STOPPED: state_str = "STOPPED"; break;
                            case TWAI_STATE_RUNNING: state_str = "RUNNING"; break;
                            case TWAI_STATE_BUS_OFF: state_str = "BUS_OFF"; break;
                            case TWAI_STATE_RECOVERING: state_str = "RECOVERING"; break;
                        }
                        CAN_DEBUG_ERROR("TX ESP_ERR_INVALID_STATE: state=%s, tx_err=%u, rx_err=%u, to_tx=%lu, to_rx=%lu",
                                       state_str,
                                       (unsigned)diagnostic_status.tx_error_counter,
                                       (unsigned)diagnostic_status.rx_error_counter,
                                       (unsigned long)diagnostic_status.msgs_to_tx,
                                       (unsigned long)diagnostic_status.msgs_to_rx);
                    }
                }

                // Check for restart with exponential backoff to avoid hammering the bus
                bool should_attempt_recovery = false;
                if (now_ms - last_recovery_attempt_ms >= recovery_backoff_ms) {
                    should_attempt_recovery = true;
                    last_recovery_attempt_ms = now_ms;

                    // Exponential backoff: double the delay each time, max 5 seconds
                    recovery_backoff_ms = MIN(recovery_backoff_ms * 2, 5000);
                }

                if (should_attempt_recovery) {
                    iface->update_error_stats(0x08); // Invalid state error

                    // Decide what to do based on actual state
                    if (got_status) {
                        if (diagnostic_status.state == TWAI_STATE_STOPPED) {
                            // Try to start the bus again, but with backoff
                            CAN_DEBUG_INFO("TWAI is STOPPED, attempting to start (backoff=%lums)",
                                          (unsigned long)recovery_backoff_ms);
                            esp_err_t start_res = twai_start();
                            if (start_res != ESP_OK) {
                                CAN_DEBUG_ERROR("Failed to restart TWAI: %d", start_res);
                                // If start fails, try full restart
                                iface->attempt_driver_restart();
                            } else {
                                // Reset backoff on successful start
                                recovery_backoff_ms = 100;
                            }
                        } else if (diagnostic_status.state == TWAI_STATE_BUS_OFF) {
                            // Need recovery
                            CAN_DEBUG_INFO("TWAI is BUS_OFF, initiating recovery");
                            twai_initiate_recovery();
                        } else if (diagnostic_status.state == TWAI_STATE_RECOVERING) {
                            // Already recovering, just wait
                            CAN_DEBUG_INFO("TWAI is RECOVERING, waiting...");
                        } else if (diagnostic_status.state == TWAI_STATE_RUNNING) {
                            // This shouldn't happen - RUNNING but getting invalid state?
                            CAN_DEBUG_ERROR("TWAI reports RUNNING but TX returns INVALID_STATE - possible driver bug");
                            // Reset backoff since we're supposedly running
                            recovery_backoff_ms = 100;
                        }
                    } else {
                        // Couldn't get status, try full restart
                        iface->attempt_driver_restart();
                    }
                    invalid_state_count = 0;  // Reset counter after action
                }

                // Log less frequently to avoid spam
                if (now_ms - last_invalid_state_log_ms > 10000) {  // Log at most every 10 seconds
                    CAN_DEBUG_ERROR("TWAI invalid state (no other nodes?) - count=%lu, dropped=%lu",
                                   (unsigned long)invalid_state_count, (unsigned long)messages_dropped);
                    last_invalid_state_log_ms = now_ms;
                    messages_dropped = 0;  // Reset dropped count after logging
                }

                // Important: Continue loop to process next message instead of blocking
                // This prevents TX queue from filling up during invalid state
                continue;
            } else if (result == ESP_ERR_INVALID_ARG) {
                // Invalid argument - possibly corrupted message data
                // Rate limit this error to avoid spam
                static uint32_t last_invalid_arg_log_ms = 0;
                static uint32_t invalid_arg_count = 0;
                uint32_t now_ms = AP_HAL::millis();
                invalid_arg_count++;
                
                if (now_ms - last_invalid_arg_log_ms > 5000) {  // Log at most every 5 seconds
                    CAN_DEBUG_ERROR("TWAI invalid argument errors: %lu occurrences (last ID=0x%08X)", 
                                   (unsigned long)invalid_arg_count, (unsigned)tx_item.frame.id);
                    last_invalid_arg_log_ms = now_ms;
                    invalid_arg_count = 0;  // Reset counter
                }
                iface->update_error_stats(0x09); // Invalid argument error
            } else {
                // Other errors
                iface->update_error_stats(result);
                CAN_DEBUG_ERROR("Error %d on message ID=0x%08X", result, 
                                (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID));
            }
        }
    }
}

// ESP32_CANBase pure virtual implementations
bool CANIface::configure_hw_filters(const CanFilterConfig* filter_configs, uint16_t num_configs)
{
    if (!initialized) {
        // Store filters for later application during init
        return true;
    }
    
    // ESP32 TWAI has single filter with acceptance code and mask
    // We need to calculate least-common-denominator filter for all requested filters
    uint32_t combined_acceptance = 0x00000000;
    uint32_t combined_mask = 0x00000000;  // Start permissive, will restrict based on filters
    
    if (num_configs > 0) {
        // Find the common mask bits across all filters
        uint32_t common_mask_bits = 0x1FFFFFFF;  // Start with all bits
        
        for (uint16_t i = 0; i < num_configs; i++) {
            const auto& filter = filter_configs[i];
            // Only keep mask bits that are common across ALL filters
            common_mask_bits &= filter.mask;
        }
        
        // Use the first filter's ID with the common mask
        if (num_configs == 1) {
            // Single filter - use exact match
            combined_acceptance = filter_configs[0].id & 0x1FFFFFFF;
            combined_mask = (~filter_configs[0].mask) & 0x1FFFFFFF;  // Invert for TWAI
        } else {
            // Multiple filters - use most permissive approach
            // Accept any message that matches at least one filter's pattern
            combined_acceptance = 0x00000000;  // Don't care about specific ID
            combined_mask = (~common_mask_bits) & 0x1FFFFFFF;  // Only filter on common bits
        }
        
        hal.console->printf("CAN%d: filters=%d, accept=0x%08lx, mask=0x%08lx\n",
                           instance, num_configs, 
                           (unsigned long)combined_acceptance, 
                           (unsigned long)combined_mask);
    } else {
        // No specific filters - accept all
        combined_acceptance = 0x00000000;
        combined_mask = 0x00000000;
        hal.console->printf("CAN%d: no filters - accepting all messages\n", instance);
    }
    
    // Apply the new filter configuration
    // Note: TWAI driver must be stopped before reconfiguring filters
    if (twai_stop() != ESP_OK) {
        CAN_DEBUG_ERROR("Failed to stop TWAI for filter reconfiguration");
        return false;
    }
    
    twai_filter_config_t new_filter;
    new_filter.acceptance_code = combined_acceptance;
    new_filter.acceptance_mask = combined_mask;
    new_filter.single_filter = true;  // Use single filter mode
    
