Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
                // Reinitialize with same configuration (use NormalMode as default)
                if (init(saved_bitrate, NormalMode)) {
                    CAN_DEBUG_INFO("Full TWAI restart successful");
                    consecutive_bus_off_count = 0; // Reset counter on successful restart
                    last_full_restart_ms = now_ms;
                } else {
                    CAN_DEBUG_ERROR("Full TWAI restart failed");
                    // Continue with basic recovery attempts
                }
            } else {
                // Standard recovery attempt
                twai_initiate_recovery();
            }
            
            last_recovery_attempt_ms = now_ms;
        }
    } else {
        // Bus is healthy, reset consecutive bus-off counter
        consecutive_bus_off_count = 0;
    }
    
    // Check for excessive TX queue backlog
    if (tx_queue && uxQueueMessagesWaiting(tx_queue) > 100) {
        CAN_DEBUG_WARN("TX queue backlog detected (%u messages)", 
                           (unsigned)uxQueueMessagesWaiting(tx_queue));
        update_error_stats(0x10); // Queue backlog error
    }
    
    // Check for RX overruns
    if (twai_status.rx_missed_count > 0) {
        static uint32_t last_rx_missed = 0;
        if (twai_status.rx_missed_count > last_rx_missed) {
            CAN_DEBUG_WARN("RX overrun detected (missed %u messages)", 
                               (unsigned)(twai_status.rx_missed_count - last_rx_missed));
            update_error_stats(0x20); // RX overrun error
        }
        last_rx_missed = twai_status.rx_missed_count;
    }
}

void CANIface::attempt_driver_restart()
{
    static uint32_t last_restart_ms = 0;
    static uint32_t restart_count = 0;
    uint32_t now_ms = AP_HAL::millis();

    // Rate limit restarts to prevent restart loops
    if (now_ms - last_restart_ms < 5000) {  // Minimum 5 seconds between restarts (reduced from 30s)
        // Only log periodically to avoid spam
        static uint32_t last_log_ms = 0;
        if (now_ms - last_log_ms > 2000) {  // Log at most every 2 seconds
            CAN_DEBUG_INFO("Driver restart rate-limited (last restart %lu ms ago)", (unsigned long)(now_ms - last_restart_ms));
            last_log_ms = now_ms;
        }
        return;
    }

    // Prevent multiple simultaneous restart attempts
    if (restart_in_progress) {
        CAN_DEBUG_INFO("Driver restart already in progress, skipping");
        return;
    }
    
    restart_count++;
    last_restart_ms = now_ms;
    
    // Only log restart attempts periodically to reduce spam
    if (restart_count <= 3 || (restart_count % 10) == 0) {
        CAN_DEBUG_ERROR("TWAI driver restart #%lu (invalid state)", (unsigned long)restart_count);
    }
    
    // Store current configuration
    uint32_t saved_bitrate = current_bitrate;
    
    // Stop and uninstall driver (may fail if in invalid state, but continue anyway)
    // Set a flag to signal RX/TX tasks to pause during restart
    restart_in_progress = true;

    // Give RX/TX tasks time to see the flag and exit any blocking calls
    // Feed watchdog during this delay
    hal.scheduler->delay(150); // 150ms to ensure RX task sees timeout, with watchdog feeding

    // Now attempt to stop TWAI - use non-blocking approach
    esp_err_t result = ESP_OK;

    // Check current state first
    twai_status_info_t status;
    if (twai_get_status_info(&status) == ESP_OK) {
        CAN_DEBUG_INFO("TWAI state before stop: %d, msgs_to_tx: %lu, msgs_to_rx: %lu",
                       status.state, (unsigned long)status.msgs_to_tx, (unsigned long)status.msgs_to_rx);

        // Only try to stop if not already stopped
        if (status.state != TWAI_STATE_STOPPED) {
            result = twai_stop();
            if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) {
                CAN_DEBUG_WARN("TWAI stop failed (error %d), forcing uninstall", result);
            }
        }
    }

    // Always try to uninstall, even if stop failed
    result = twai_driver_uninstall();
    if (result != ESP_OK) {
        CAN_DEBUG_WARN("TWAI uninstall failed (error %d), continuing anyway", result);
    }

    // Brief delay to let hardware settle
    hal.scheduler->delay(10); // 10ms with watchdog feeding
    
    // Clear queues (they should be empty after stop/uninstall, but be safe)
    if (rx_queue) {
        xQueueReset(rx_queue);
    }
    if (tx_queue) {
        xQueueReset(tx_queue);
    }
    
    // Reinitialize with saved configuration
    initialized = false;
    bool reinit_ok = init(saved_bitrate, NormalMode);

    if (reinit_ok) {
        // Give TWAI driver time to fully stabilize before allowing tasks to resume
        hal.scheduler->delay(50); // 50ms for TWAI to stabilize, with watchdog feeding

        // Now clear the restart flag to allow tasks to resume
        restart_in_progress = false;

        CAN_DEBUG_INFO("TWAI driver restart successful after %lu restarts", (unsigned long)restart_count);
        update_error_stats(0x00); // Clear error state
    } else {
        // Clear flag even on failure to prevent permanent task blocking
        restart_in_progress = false;

        CAN_DEBUG_ERROR("TWAI driver restart failed - interface may be unusable");
    }
}

#endif // HAL_NUM_CAN_IFACES > 0
